# L = ["a","b","c","d","e","0","1","2"]
# print(L.index("d")) # 元素 d 的索引
# print(L.index("0")) # 元素 d 的索引
#
# print(L) #原始
# L.insert(2,"abc") #索引2位置插入 "abc"
# print(L)
# del L[4] # 删除索引为4的元素
# print(L)
# L[5] = 6 # 更新索引为5的元素为6
# print(L)
# print("---------") # 为了区分输出结果属于那部分
#
# L2 =L.copy() #
# print(L)
# print(L2)
# L.pop() # 删除L的最后一个元素
# print(L)
# print(L2)
#
#
#
#
#
#


Dic = {"name":"动物园","孔雀":10,"鸡":5,"鹅":3}
print(Dic)
Dic["羊"]=7
print(Dic)
print(Dic["孔雀"])
Dic["孔雀"] = 6

print("现在孔雀有",Dic["孔雀"],"个")
print("现在鸡有",Dic["鸡"],"个")
print("现在鹅有",Dic["鹅"],"个")


"""

List = [] # 定义变量List为一个列表变量。

List.append("0") # 添加元素"0" 到列表的结尾处。

List.pop() # 删除列表尾部的1个元素。

List.remove("0") #删除列表里面的"0"元素。

List.index("a") #查找列表List里面的元素"a" 的索引值。

List.insert(2,"abc") # 索引为2的位置，插入元素"abc"。

del List[3] # 删除列表List里面，索引为3的元素。

List[4] = 456 # 更新索引为4的元素为 456

L2 = List.copy() #L2 是复制List



字典的数据是以键值对出现的，多个键值对之间用逗号隔开。

Dic = {"店名":"大良旗舰店","类目":"户外用品","烧烤架":50,"帐篷":99} # 定义变量Dic为一个字典类型的变量。

Dic["店名"] #查找关键字为店名的值。

Dic["店名"] = "直营店" #更新关键字为店名的值为"直营店"； 如果不存在店名这个关键字，则在字典Dic里面新增一个"店名"的键，并把它的值设置为"直营店"。




"""

